Map<String, dynamic> categoryDetail = {
  '직접입력': [],
  '예방접종': [
    ['종합백신1', ''],
    ['코로나 장염1', ''],
    ['켄넬코프1', ''],
    ['인플루엔자1', ''],
    ['광견병1', ''],
    ['항체가검사1', ''],
    ['심장사상충1', ''],
    ['외부기생충1', ''],
  ],
  '구충제 바르기': [
    ['종합백신2', ''],
    ['코로나 장염2', ''],
    ['켄넬코프2', ''],
    ['인플루엔자2', ''],
    ['광견병2', ''],
    ['항체가검사2', ''],
    ['심장사상충2', ''],
    ['외부기생충2', ''],
  ],
  '건강검진': [
    ['종합백신3', ''],
    ['코로나 장염3', ''],
    ['켄넬코프3', ''],
    ['인플루엔자3', ''],
    ['광견병3', ''],
    ['항체가검사3', ''],
    ['심장사상충3', ''],
    ['외부기생충3', ''],
  ],
  '기타': [
    ['종합백신', ''],
  ],
};
List<String> categoryKey = ['직접입력', '예방접종', '구충제 바르기', '건강검진', '기타'];
